In [4]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [5]:
height=Series([187,190,185,178,185],index=['13','14','7','2','9'])

In [6]:
height

13    187
14    190
7     185
2     178
9     185
dtype: int64

In [7]:
height1=Series({'13':187,'14':190,'7':185,'2':178,'9':185})

In [8]:
height['13']

187

In [9]:
height[['13','2','7']]

13    187
2     178
7     185
dtype: int64

In [10]:
height[1:3]

14    190
7     185
dtype: int64

In [11]:
height[ height.values>=186 ]

13    187
14    190
dtype: int64

In [12]:
height['13'] = 188

In [26]:
height[1:3] = 160

In [27]:
height

13    188
14    160
7     160
2     178
9     185
dtype: int64

In [28]:
a = Series([190,187], index=['23','5'])

In [29]:
newheight = height.append( a )

In [30]:
newheight

13    188
14    160
7     160
2     178
9     185
23    190
5     187
dtype: int64

In [31]:
height

13    188
14    160
7     160
2     178
9     185
dtype: int64

In [32]:
a = Series([190,187], index=['23','5'])

In [33]:
newheight = height.append( a )

In [34]:
newheight

13    188
14    160
7     160
2     178
9     185
23    190
5     187
dtype: int64

In [39]:
height

13    188
14    160
7     160
2     178
9     185
dtype: int64

In [40]:
newheight = height.drop(['13','9'])

In [41]:
newheight

14    160
7     160
2     178
dtype: int64

In [43]:
height.index=[1,2,3,4,5]
height

1    188
2    160
3    160
4    178
5    185
dtype: int64

In [44]:
height=Series([187,190,185,178,185],index=[13,14,7,2,9])

In [45]:
height

13    187
14    190
7     185
2     178
9     185
dtype: int64

In [47]:
height[ [14,7]]

14    190
7     185
dtype: int64

In [48]:
height.iloc[0]

187

In [49]:
data = [[19,170,68],[20,165,65],[18,175,65]]

In [50]:
students = DataFrame(data, index=[1,2,3], columns=['age','height','weight'])

In [51]:
students

   age  height  weight
1   19     170      68
2   20     165      65
3   18     175      65

In [52]:
students.loc[ 1, 'age']

19

In [53]:
students.loc[[1,3], ['height','weight']]

   height  weight
1     170      68
3     175      65

In [54]:
students.iloc[[0,2],[0,1]]

   age  height
1   19     170
3   18     175

In [55]:
students.loc[ : , ['height','weight']]

   height  weight
1     170      68
2     165      65
3     175      65

In [56]:
students[['height','weight']]

   height  weight
1     170      68
2     165      65
3     175      65

In [57]:
students.iloc[1:, 0:2]

   age  height
2   20     165
3   18     175

In [58]:
students[1:3 ]

   age  height  weight
2   20     165      65
3   18     175      65

In [60]:
mask = students['height']>=168

In [62]:
mask

1     True
2    False
3     True
Name: height, dtype: bool

In [63]:
students.loc[ mask, ['height','weight'] ]

   height  weight
1     170      68
3     175      65

In [64]:
students['expense'] = [1500,1600,1200]

In [65]:
students

   age  height  weight  expense
1   19     170      68     1500
2   20     165      65     1600
3   18     175      65     1200

In [66]:
students['expense'] = 1000

In [67]:
students

   age  height  weight  expense
1   19     170      68     1000
2   20     165      65     1000
3   18     175      65     1000

In [68]:
students.loc[1, :] = [21,188,70,20]

In [69]:
students

   age  height  weight  expense
1   21     188      70       20
2   20     165      65     1000
3   18     175      65     1000

In [73]:
students.loc[students['expense']<500, 'expense'] = 1200

In [74]:
students

   age  height  weight  expense
1   21     188      70     1200
2   20     165      65     1000
3   18     175      65     1000

In [75]:
print(students.drop(1, axis=0))

   age  height  weight  expense
2   20     165      65     1000
3   18     175      65     1000

In [77]:
students.drop('expense', axis=1)

   age  height  weight
1   21     188      70
2   20     165      65
3   18     175      65

In [78]:
students.drop([1, 2], axis=0)

   age  height  weight  expense
3   18     175      65     1000

In [79]:
students.drop(['age','weight'], axis=1, inplace=True)

In [80]:
students

   height  expense
1     188     1200
2     165     1000
3     175     1000